UPDATE products SET supplier = ELT(
  1 + (id MOD 15),
  'ASBIS',
  'MTI',
  'ELKO Київ',
  'Brain',
  'Comfy Trade',
  'ТехноСвіт',
  'Дніпро-М',
  'ТОВ "Комптек"',
  'АСБІС-Україна',
  'Фокстрот. Техніка для дому',
  'ТОВ "Технополіс"',
  'Товариство з обмеженою відповідальністю "Технологічна Дистрибуційна Компанія Україна"',
  'Приватне підприємство "Об''єднана Торгово-Технічна Компанія Схід-Захід"',
  'Товариство з обмеженою відповідальністю "Міжнародний Постачальник Комп''ютерної Техніки та Периферії"',
  'Приватне акціонерне товариство "Всеукраїнська Гуртова База Побутової Техніки"'
);
